examples/job_manager.org
#+TITLE:     JobManager
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc author:nil
#+INFOJS_OPT: view:nil toc:t ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+SETUPFILE: theme-readtheorg.setup
#+LATEX_HEADER: \usepackage[top=1in, bottom=1.in, left=1in, right=1in]{geometry}

* Introduction
  :PROPERTIES:
  :CUSTOM_ID: sec-introduction
  :END:
The purpose of the ~JobManager~ module is to provide a python wrapper for submitting and tracking jobs in a queue environment.

* Configuration
  :PROPERTIES:
  :CUSTOM_ID: sec-configuration
  :END:
The ~JobManager~ is initially built for a PBS queue environment, so many of the commands will have to be modified for usage in a different queue environment. These customizations will likely take place in the following files.

1. The ~submit~ and ~write_submit~ function in the ~structopt/utilities/job_manager.py~ file will likely need to be updated to reflect your specific queue environment.

2. The dictionaries held in ~structopt.utilities/rc.py~ is the first attempt to store some dictionaries specific to the queue environment. Many queue specific variables are drawn from here.

* Submitting jobs
  :PROPERTIES:
  :CUSTOM_ID: sec-submit
  :END:
