examples/job_manager.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-01-23 Mon 13:10 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>JobManager</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Zhongnan Xu" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">JobManager</h1>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="sec-introduction"><a id="orgheadline1"></a>Introduction</h2>
<div class="outline-text-2" id="text-sec-introduction">
<p>
The purpose of the <code>JobManager</code> module is to provide a python wrapper for submitting and tracking jobs in a queue environment.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="sec-configuration"><a id="orgheadline2"></a>Configuration</h2>
<div class="outline-text-2" id="text-sec-configuration">
<p>
The <code>JobManager</code> is initially built for a PBS queue environment, so many of the commands will have to be modified for usage in a different queue environment. These customizations will likely take place in the following files.
</p>

<ol class="org-ol">
<li>The <code>submit</code> and <code>write_submit</code> function in the <code>structopt/utilities/job_manager.py</code> file will likely need to be updated to reflect your specific queue environment.</li>

<li>The dictionaries held in <code>structopt.utilities/rc.py</code> is the first attempt to store some dictionaries specific to the queue environment. Many queue specific variables are drawn from here.</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="sec-submit"><a id="orgheadline5"></a>Submitting jobs</h2>
<div class="outline-text-2" id="text-sec-submit">
</div>
