examples/job_manager.org
** Single job
  :PROPERTIES:
  :CUSTOM_ID: sec-submit-single
  :END:

  The script below is an example script of submitting a single job to a queue using the ~JobManager~. The optimization run is a short run of a Au_55 nanoparticle using only LAMMPS. A large part of the script is defining the input, which goes into the ~JobManager~ class. These inputs are given below.

1. ~calcdir~: This is a string that tells where the calculation is run. Note that the calculation itself is run within the ~calcdir/logs{time}~ directory, which is created when the job starts to run on the queue. Unless an absolute path, the ~calcdir~ directory is always given with respect to directory that the job script is run from

2. ~optimizer~: This is a string of the optimizer file used for the calculation. These files can be found in the ~structopt/optimizers~ folder. Upon run, a copy of this script is placed insde of the ~calcdir~ directory and accessed from there.

3. ~StructOpt_parameters~: This is a dictionary object that should mirror the input file you are trying to submit

4. ~submit_parameters~: This dictionary holds the submit parameters. These will be specific to the queue system in use. In this example, we specify the the submission system, queue, number of nodes, number of cores, and walltime.

#+BEGIN_SRC python
from structopt.utilities.job_manager import JobManager
from structopt.utilities.exceptions import Running, Submitted, Queued

calcdir = 'job_manager_examples/Au55-example'

LAMMPS_parameters = {"use_mpi4py": True,
	             "MPMD": 0,
	             "keep_files": False,
	             "min_style": "cg",
                     "min_modify": "line quadratic",
	             "minimize": "1e-8 1e-8 5000 10000",
	             "pair_style": "eam",
	             "potential_file": "$STRUCTOPT_HOME/potentials/Au_u3.eam",
	             "thermo_steps": 0}

StructOpt_parameters = {
    "seed": 0,
    "structure_type": "cluster",
    "generators": {"sphere": {"number_of_individuals": 20,
		              "kwargs": {"atomlist": [["Au", 55]],
			                 "cell": [20, 20, 20]}}},
    "fitnesses": {"LAMMPS": {"weight": 1.0,
	           "kwargs": LAMMPS_parameters}},
    "relaxations": {"LAMMPS": {"order": 0,
                               "kwargs": LAMMPS_parameters}},
    "convergence": {"max_generations": 10},
    "mutations": {"move_atoms": {"probability": 0.1},
	          "rotate_cluster": {"probability": 0.1}},
    "crossovers": {"rotate": {"probability": 0.7}},
    "predators": {"best": {"probability": 1.0}},
    "selections": {"rank": {"probability": 1.0,
                            "kwargs": {"unique_pairs": False,
                                       "unique_parents": False}}},
    "fingerprinters": {"keep_best": True,
                       "diversify_module": {"probability": 1.0,
                                            "kwargs": {"module": "LAMMPS",
                                                       "min_diff": 0.001}}},
    "post_processing": {"XYZs": -1},
}

submit_parameters = {'system': 'PBS',
                     'queue': 'morgan2',
                     'nodes': 1,
                     'cores': 12,
                     'walltime': 12}

optimizer = 'genetic.py'

job = JobManager(calcdir, optimizer, StructOpt_parameters, submit_parameters)
job.optimize()

#+END_SRC

#+RESULTS:
:RESULTS:
:END:

Upon running this script, the user should get back an exception called =structopt.utilities.exceptions.Submitted= with the jobid. This is normal behavior and communicates that the job has successfully been submitted.

#+RESULTS:
:RESULTS:
:END:

