examples/job_manager.html
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="sec-submit-single"><a id="orgheadline3"></a>Single job</h3>
<div class="outline-text-3" id="text-sec-submit-single">
<p>
The script below is an example script of submitting a single job to a queue using the <code>JobManager</code>. The optimization run is a short run of a Au<sub>55</sub> nanoparticle using only LAMMPS. A large part of the script is defining the input, which goes into the <code>JobManager</code> class. These inputs are given below.
</p>

<ol class="org-ol">
<li><code>calcdir</code>: This is a string that tells where the calculation is run. Note that the calculation itself is run within the <code>calcdir/logs{time}</code> directory, which is created when the job starts to run on the queue. Unless an absolute path, the <code>calcdir</code> directory is always given with respect to directory that the job script is run from</li>

<li><code>optimizer</code>: This is a string of the optimizer file used for the calculation. These files can be found in the <code>structopt/optimizers</code> folder. Upon run, a copy of this script is placed insde of the <code>calcdir</code> directory and accessed from there.</li>

<li><code>StructOpt_parameters</code>: This is a dictionary object that should mirror the input file you are trying to submit</li>

<li><code>submit_parameters</code>: This dictionary holds the submit parameters. These will be specific to the queue system in use. In this example, we specify the the submission system, queue, number of nodes, number of cores, and walltime.</li>
</ol>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">from</span> structopt.utilities.job_manager <span style="color: #0000FF;">import</span> JobManager
<span style="color: #0000FF;">from</span> structopt.utilities.exceptions <span style="color: #0000FF;">import</span> Running, Submitted, Queued

<span style="color: #BA36A5;">calcdir</span> = <span style="color: #008000;">'job_manager_examples/Au55-example'</span>

<span style="color: #BA36A5;">LAMMPS_parameters</span> = {<span style="color: #008000;">"use_mpi4py"</span>: <span style="color: #D0372D;">True</span>,
                     <span style="color: #008000;">"MPMD"</span>: 0,
                     <span style="color: #008000;">"keep_files"</span>: <span style="color: #D0372D;">False</span>,
                     <span style="color: #008000;">"min_style"</span>: <span style="color: #008000;">"cg"</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">"min_modify"</span>: <span style="color: #008000;">"line quadratic"</span>,
                     <span style="color: #008000;">"minimize"</span>: <span style="color: #008000;">"1e-8 1e-8 5000 10000"</span>,
                     <span style="color: #008000;">"pair_style"</span>: <span style="color: #008000;">"eam"</span>,
                     <span style="color: #008000;">"potential_file"</span>: <span style="color: #008000;">"$STRUCTOPT_HOME/potentials/Au_u3.eam"</span>,
                     <span style="color: #008000;">"thermo_steps"</span>: 0}

<span style="color: #BA36A5;">StructOpt_parameters</span> = {
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"seed"</span>: 0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"structure_type"</span>: <span style="color: #008000;">"cluster"</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"generators"</span>: {<span style="color: #008000;">"sphere"</span>: {<span style="color: #008000;">"number_of_individuals"</span>: 20,
                              <span style="color: #008000;">"kwargs"</span>: {<span style="color: #008000;">"atomlist"</span>: [[<span style="color: #008000;">"Au"</span>, 55]],
                                         <span style="color: #008000;">"cell"</span>: [20, 20, 20]}}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"fitnesses"</span>: {<span style="color: #008000;">"LAMMPS"</span>: {<span style="color: #008000;">"weight"</span>: 1.0,
                   <span style="color: #008000;">"kwargs"</span>: LAMMPS_parameters}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"relaxations"</span>: {<span style="color: #008000;">"LAMMPS"</span>: {<span style="color: #008000;">"order"</span>: 0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"kwargs"</span>: LAMMPS_parameters}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"convergence"</span>: {<span style="color: #008000;">"max_generations"</span>: 10},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"mutations"</span>: {<span style="color: #008000;">"move_atoms"</span>: {<span style="color: #008000;">"probability"</span>: 0.1},
                  <span style="color: #008000;">"rotate_cluster"</span>: {<span style="color: #008000;">"probability"</span>: 0.1}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"crossovers"</span>: {<span style="color: #008000;">"rotate"</span>: {<span style="color: #008000;">"probability"</span>: 0.7}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"predators"</span>: {<span style="color: #008000;">"best"</span>: {<span style="color: #008000;">"probability"</span>: 1.0}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"selections"</span>: {<span style="color: #008000;">"rank"</span>: {<span style="color: #008000;">"probability"</span>: 1.0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"kwargs"</span>: {<span style="color: #008000;">"unique_pairs"</span>: <span style="color: #D0372D;">False</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"unique_parents"</span>: <span style="color: #D0372D;">False</span>}}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"fingerprinters"</span>: {<span style="color: #008000;">"keep_best"</span>: <span style="color: #D0372D;">True</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"diversify_module"</span>: {<span style="color: #008000;">"probability"</span>: 1.0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"kwargs"</span>: {<span style="color: #008000;">"module"</span>: <span style="color: #008000;">"LAMMPS"</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"min_diff"</span>: 0.001}}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"post_processing"</span>: {<span style="color: #008000;">"XYZs"</span>: -1},
}

<span style="color: #BA36A5;">submit_parameters</span> = {<span style="color: #008000;">'system'</span>: <span style="color: #008000;">'PBS'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'queue'</span>: <span style="color: #008000;">'morgan2'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'nodes'</span>: 1,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'cores'</span>: 12,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'walltime'</span>: 12}

<span style="color: #BA36A5;">optimizer</span> = <span style="color: #008000;">'genetic.py'</span>

<span style="color: #BA36A5;">job</span> = JobManager(calcdir, optimizer, StructOpt_parameters, submit_parameters)
job.optimize()
</pre>
</div>

<p>
Upon running this script, the user should get back an exception called <code>structopt.utilities.exceptions.Submitted</code> with the jobid. This is normal behavior and communicates that the job has successfully been submitted.
</p>
</div>
</div>
