examples/job_manager.org
** Multiple jobs
  :PROPERTIES:
  :CUSTOM_ID: sec-submit-multiple
  :END:

One advantage of the job manager is that it allows one to submit multiple jobs to the queue. This is often useful for tuning the optimizer against different inputs. The script below is an example of submitting the same job at different seeds.

In the previous script, submitting a single job successfully with ~JobManager.optimizer~ method resulted in an exception. We can catch this exception with a ~try~ and ~except~ statement. This is shown below in the script where upon a successful submission, the script prints out the jobid to the user.

#+BEGIN_SRC python :results output
from structopt.utilities.job_manager import JobManager
from structopt.utilities.exceptions import Running, Submitted, Queued

LAMMPS_parameters = {"use_mpi4py": True,
	             "MPMD": 0,
	             "keep_files": False,
	             "min_style": "cg",
                     "min_modify": "line quadratic",
	             "minimize": "1e-8 1e-8 5000 10000",
	             "pair_style": "eam",
	             "potential_file": "$STRUCTOPT_HOME/potentials/Au_u3.eam",
	             "thermo_steps": 0}

StructOpt_parameters = {
    "seed": 0,
    "structure_type": "cluster",
    "generators": {"sphere": {"number_of_individuals": 20,
		              "kwargs": {"atomlist": [["Au", 55]],
			                 "cell": [20, 20, 20]}}},
    "fitnesses": {"LAMMPS": {"weight": 1.0,
	           "kwargs": LAMMPS_parameters}},
    "relaxations": {"LAMMPS": {"order": 0,
                               "kwargs": LAMMPS_parameters}},
    "convergence": {"max_generations": 10},
    "mutations": {"move_atoms": {"probability": 0.1},
	          "rotate_cluster": {"probability": 0.1}},
    "crossovers": {"rotate": {"probability": 0.7}},
    "predators": {"best": {"probability": 1.0}},
    "selections": {"rank": {"probability": 1.0,
                            "kwargs": {"unique_pairs": False,
                                       "unique_parents": False}}},
    "fingerprinters": {"keep_best": True,
                       "diversify_module": {"probability": 1.0,
                                            "kwargs": {"module": "LAMMPS",
                                                       "min_diff": 0.001}}},
    "post_processing": {"XYZs": -1},
}

submit_parameters = {'system': 'PBS',
                     'queue': 'morgan2',
                     'nodes': 1,
                     'cores': 12,
                     'walltime': 12}

optimizer = 'genetic.py'

seeds = [0, 1, 2, 3, 4]
for seed in seeds:
    StructOpt_parameters['seed'] = seed
    calcdir = 'job_manager_examples/Au55-seed-{}'.format(seed)

    job = JobManager(calcdir, optimizer, StructOpt_parameters, submit_parameters)

    try:
        job.optimize()
    except Submitted:
        print(calcdir, job.get_jobid(), 'submitted')
#+END_SRC

#+RESULTS:
: job_manager_examples/Au55-seed-0 936454.bardeen.msae.wisc.edu submitted
: job_manager_examples/Au55-seed-1 936455.bardeen.msae.wisc.edu submitted
: job_manager_examples/Au55-seed-2 936456.bardeen.msae.wisc.edu submitted
: job_manager_examples/Au55-seed-3 936457.bardeen.msae.wisc.edu submitted
: job_manager_examples/Au55-seed-4 936458.bardeen.msae.wisc.edu submitted

