examples/job_manager.html

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="sec-submit-multiple"><a id="orgheadline4"></a>Multiple jobs</h3>
<div class="outline-text-3" id="text-sec-submit-multiple">
<p>
One advantage of the job manager is that it allows one to submit multiple jobs to the queue. This is often useful for tuning the optimizer against different inputs. The script below is an example of submitting the same job at different seeds.
</p>

<p>
In the previous script, submitting a single job successfully with <code>JobManager.optimizer</code> method resulted in an exception. We can catch this exception with a <code>try</code> and <b>except</b> statement. This is shown below in the script where upon a successful submission, the script prints out the jobid to the user.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">from</span> structopt.utilities.job_manager <span style="color: #0000FF;">import</span> JobManager
<span style="color: #0000FF;">from</span> structopt.utilities.exceptions <span style="color: #0000FF;">import</span> Running, Submitted, Queued

<span style="color: #BA36A5;">LAMMPS_parameters</span> = {<span style="color: #008000;">"use_mpi4py"</span>: <span style="color: #D0372D;">True</span>,
                     <span style="color: #008000;">"MPMD"</span>: 0,
                     <span style="color: #008000;">"keep_files"</span>: <span style="color: #D0372D;">False</span>,
                     <span style="color: #008000;">"min_style"</span>: <span style="color: #008000;">"cg"</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">"min_modify"</span>: <span style="color: #008000;">"line quadratic"</span>,
                     <span style="color: #008000;">"minimize"</span>: <span style="color: #008000;">"1e-8 1e-8 5000 10000"</span>,
                     <span style="color: #008000;">"pair_style"</span>: <span style="color: #008000;">"eam"</span>,
                     <span style="color: #008000;">"potential_file"</span>: <span style="color: #008000;">"$STRUCTOPT_HOME/potentials/Au_u3.eam"</span>,
                     <span style="color: #008000;">"thermo_steps"</span>: 0}

<span style="color: #BA36A5;">StructOpt_parameters</span> = {
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"seed"</span>: 0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"structure_type"</span>: <span style="color: #008000;">"cluster"</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"generators"</span>: {<span style="color: #008000;">"sphere"</span>: {<span style="color: #008000;">"number_of_individuals"</span>: 20,
                              <span style="color: #008000;">"kwargs"</span>: {<span style="color: #008000;">"atomlist"</span>: [[<span style="color: #008000;">"Au"</span>, 55]],
                                         <span style="color: #008000;">"cell"</span>: [20, 20, 20]}}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"fitnesses"</span>: {<span style="color: #008000;">"LAMMPS"</span>: {<span style="color: #008000;">"weight"</span>: 1.0,
                   <span style="color: #008000;">"kwargs"</span>: LAMMPS_parameters}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"relaxations"</span>: {<span style="color: #008000;">"LAMMPS"</span>: {<span style="color: #008000;">"order"</span>: 0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"kwargs"</span>: LAMMPS_parameters}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"convergence"</span>: {<span style="color: #008000;">"max_generations"</span>: 10},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"mutations"</span>: {<span style="color: #008000;">"move_atoms"</span>: {<span style="color: #008000;">"probability"</span>: 0.1},
                  <span style="color: #008000;">"rotate_cluster"</span>: {<span style="color: #008000;">"probability"</span>: 0.1}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"crossovers"</span>: {<span style="color: #008000;">"rotate"</span>: {<span style="color: #008000;">"probability"</span>: 0.7}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"predators"</span>: {<span style="color: #008000;">"best"</span>: {<span style="color: #008000;">"probability"</span>: 1.0}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"selections"</span>: {<span style="color: #008000;">"rank"</span>: {<span style="color: #008000;">"probability"</span>: 1.0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"kwargs"</span>: {<span style="color: #008000;">"unique_pairs"</span>: <span style="color: #D0372D;">False</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"unique_parents"</span>: <span style="color: #D0372D;">False</span>}}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"fingerprinters"</span>: {<span style="color: #008000;">"keep_best"</span>: <span style="color: #D0372D;">True</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"diversify_module"</span>: {<span style="color: #008000;">"probability"</span>: 1.0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"kwargs"</span>: {<span style="color: #008000;">"module"</span>: <span style="color: #008000;">"LAMMPS"</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"min_diff"</span>: 0.001}}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"post_processing"</span>: {<span style="color: #008000;">"XYZs"</span>: -1},
}

<span style="color: #BA36A5;">submit_parameters</span> = {<span style="color: #008000;">'system'</span>: <span style="color: #008000;">'PBS'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'queue'</span>: <span style="color: #008000;">'morgan2'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'nodes'</span>: 1,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'cores'</span>: 12,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'walltime'</span>: 12}

<span style="color: #BA36A5;">optimizer</span> = <span style="color: #008000;">'genetic.py'</span>

<span style="color: #BA36A5;">seeds</span> = [0, 1, 2, 3, 4]
<span style="color: #0000FF;">for</span> seed <span style="color: #0000FF;">in</span> seeds:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">StructOpt_parameters</span>[<span style="color: #008000;">'seed'</span>] = seed
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">calcdir</span> = <span style="color: #008000;">'job_manager_examples/Au55-seed-{}'</span>.<span style="color: #006FE0;">format</span>(seed)

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #BA36A5;">job</span> = JobManager(calcdir, optimizer, StructOpt_parameters, submit_parameters)

<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">try</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   job.optimize()
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">except</span> Submitted:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(calcdir, job.get_jobid(), <span style="color: #008000;">'submitted'</span>)
</pre>
</div>
</div>
</div>
</div>
