examples/job_manager.org
* Tracking jobs
  :PROPERTIES:
  :CUSTOM_ID: sec-track
  :END:

In the previous section, we covered how to submit a new job from an empty directory. This is done by first initializing an instance of the ~StructOpt.utilities.job_manager.JobManager~ class with a calculation directory along with some input files and then submitting the job with the ~JobManager.optimize~ method. The ~JobManager.optimize~ method knows what to do because upon initialization, it detected an empty directory. If the directory was not empty and contained a StructOpt job, the ~JobManager~ knows what to do with it if ~optimize~ was run again. This is all done with exceptions.

The four primary exceptions that are returned upon executing the ~optimize~ method are below along with their explanations.

1. ~Submitted~: This exception is returned if a job is submitted from the directory. This is done when ~JobManager.optimize~ is called in an empty directory or ~JobManager.optimize~ is called with the kwarg ~restart=True~ in a directory where a job is not queued or running.

2. ~Queued~: The job is queued and has not started running. There should be no output files to be analyzed.

3. ~Running~: The job is running and output files should be continously be updated. These output files can be used for analysis before the job has finished running.

4. ~UnknownState~: This is returned if the ~calcdir~ is not an empty directory doesn't detect it as a StructOpt run. A StructOpt run is detected when a ~structopt.in.json~ file is found in the ~calcdir~.

Note that if no exception is returned, it means the job is done and is ready to be analyzed. ~Job.optimize~ does nothing in this case.

One way of using these three exceptions is below. If the job is submitted or Queued, we want the script to stop and not submit the job. If it is running, additional commands can be used to track the progress of the job.

#+BEGIN_SRC python
from structopt.utilities.job_manager import JobManager
from structopt.utilities.exceptions import Running, Submitted, Queued

calcdir = 'job_manager_examples/Au55-example'

LAMMPS_parameters = {"use_mpi4py": True,
	             "MPMD": 0,
	             "keep_files": False,
	             "min_style": "cg",
                     "min_modify": "line quadratic",
	             "minimize": "1e-8 1e-8 5000 10000",
	             "pair_style": "eam",
	             "potential_file": "$STRUCTOPT_HOME/potentials/Au_u3.eam",
	             "thermo_steps": 0}

StructOpt_parameters = {
    "seed": 0,
    "structure_type": "cluster",
    "generators": {"sphere": {"number_of_individuals": 20,
		              "kwargs": {"atomlist": [["Au", 55]],
			                 "cell": [20, 20, 20]}}},
    "fitnesses": {"LAMMPS": {"weight": 1.0,
	           "kwargs": LAMMPS_parameters}},
    "relaxations": {"LAMMPS": {"order": 0,
                               "kwargs": LAMMPS_parameters}},
    "convergence": {"max_generations": 10},
    "mutations": {"move_atoms": {"probability": 0.1},
	          "rotate_cluster": {"probability": 0.1}},
    "crossovers": {"rotate": {"probability": 0.7}},
    "predators": {"best": {"probability": 1.0}},
    "selections": {"rank": {"probability": 1.0,
                            "kwargs": {"unique_pairs": False,
                                       "unique_parents": False}}},
    "fingerprinters": {"keep_best": True,
                       "diversify_module": {"probability": 1.0,
                                            "kwargs": {"module": "LAMMPS",
                                                       "min_diff": 0.001}}},
    "post_processing": {"XYZs": -1},
}

submit_parameters = {'system': 'PBS',
                     'queue': 'morgan2',
                     'nodes': 1,
                     'cores': 12,
                     'walltime': 12}

optimizer = 'genetic.py'

job = JobManager(calcdir, optimizer, StructOpt_parameters, submit_parameters)
try:
    job.optimize()
except (Submitted, Queued):
    print(calcdir, job.get_jobid(), 'submitted or queued')
except Running:
    pass
#+END_SRC

#+RESULTS:
: job_manager_examples/Au55-example 936453.bardeen.msae.wisc.edu submitted or queued
