examples/job_manager.html

<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="sec-track"><a id="orgheadline6"></a>Tracking jobs</h2>
<div class="outline-text-2" id="text-sec-track">
<p>
In the previous section, we covered how to submit a new job from an empty directory. This is done by first initializing an instance of the <code>StructOpt.utilities.job_manager.Job</code> class with a calculation directory along with some input files and then submitting the job with the <code>Job.optimize</code> method. The <code>Job.optimize</code> method knows what to do because upon initialization, it detected an empty directory. If the directory was not empty and contained a StructOpt job, the job<sub>manager</sub> knows what to do with it if <code>Job.optimize</code> was run again. This is all done with exceptions.
</p>

<p>
The three primary exceptions that are returned upon executing the <code>Job.optimize</code> method are below along with their reasoning.
</p>

<ol class="org-ol">
<li><code>Submitted</code>: This exception is returned if a job is submitted from the directory. This is done when <code>Job.optimize</code> is called in an empty directory or <code>Job.optimize</code> is called with the kwarg <code>restart=True</code> in a directory that is not <code>Queued</code> or <code>Running</code>.</li>

<li><code>Queued</code>: The job is queued and has not started running. There should be no output files to be analyzed.</li>

<li><code>Running</code>: The job is running and output files should be continously be updated. These output files can be used for analysis before the job has finished running.</li>

<li><code>UnknownState</code>: This is returned if the <code>calcdir</code> is not an empty directory doesn't detect it as a StructOpt run.</li>
</ol>

<p>
Note that if no exception is returned, it means the job is done and is ready to be analyzed. <code>Job.optimize</code> does nothing in this case.
</p>

<p>
One way of using these three exceptions is below. If the job is submitted or Queued, we want the script to stop and not submit the job. If it is running, additional commands can be used to track the progress of the job. This is done through the <code>DataExplorer</code> module.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">from</span> structopt.utilities.job_manager <span style="color: #0000FF;">import</span> JobManager
<span style="color: #0000FF;">from</span> structopt.utilities.exceptions <span style="color: #0000FF;">import</span> Running, Submitted, Queued

<span style="color: #BA36A5;">calcdir</span> = <span style="color: #008000;">'job_manager_examples/Au55-example'</span>

<span style="color: #BA36A5;">LAMMPS_parameters</span> = {<span style="color: #008000;">"use_mpi4py"</span>: <span style="color: #D0372D;">True</span>,
                     <span style="color: #008000;">"MPMD"</span>: 0,
                     <span style="color: #008000;">"keep_files"</span>: <span style="color: #D0372D;">False</span>,
                     <span style="color: #008000;">"min_style"</span>: <span style="color: #008000;">"cg"</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">"min_modify"</span>: <span style="color: #008000;">"line quadratic"</span>,
                     <span style="color: #008000;">"minimize"</span>: <span style="color: #008000;">"1e-8 1e-8 5000 10000"</span>,
                     <span style="color: #008000;">"pair_style"</span>: <span style="color: #008000;">"eam"</span>,
                     <span style="color: #008000;">"potential_file"</span>: <span style="color: #008000;">"$STRUCTOPT_HOME/potentials/Au_u3.eam"</span>,
                     <span style="color: #008000;">"thermo_steps"</span>: 0}

<span style="color: #BA36A5;">StructOpt_parameters</span> = {
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"seed"</span>: 0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"structure_type"</span>: <span style="color: #008000;">"cluster"</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"generators"</span>: {<span style="color: #008000;">"sphere"</span>: {<span style="color: #008000;">"number_of_individuals"</span>: 20,
                              <span style="color: #008000;">"kwargs"</span>: {<span style="color: #008000;">"atomlist"</span>: [[<span style="color: #008000;">"Au"</span>, 55]],
                                         <span style="color: #008000;">"cell"</span>: [20, 20, 20]}}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"fitnesses"</span>: {<span style="color: #008000;">"LAMMPS"</span>: {<span style="color: #008000;">"weight"</span>: 1.0,
                   <span style="color: #008000;">"kwargs"</span>: LAMMPS_parameters}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"relaxations"</span>: {<span style="color: #008000;">"LAMMPS"</span>: {<span style="color: #008000;">"order"</span>: 0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"kwargs"</span>: LAMMPS_parameters}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"convergence"</span>: {<span style="color: #008000;">"max_generations"</span>: 10},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"mutations"</span>: {<span style="color: #008000;">"move_atoms"</span>: {<span style="color: #008000;">"probability"</span>: 0.1},
                  <span style="color: #008000;">"rotate_cluster"</span>: {<span style="color: #008000;">"probability"</span>: 0.1}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"crossovers"</span>: {<span style="color: #008000;">"rotate"</span>: {<span style="color: #008000;">"probability"</span>: 0.7}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"predators"</span>: {<span style="color: #008000;">"best"</span>: {<span style="color: #008000;">"probability"</span>: 1.0}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"selections"</span>: {<span style="color: #008000;">"rank"</span>: {<span style="color: #008000;">"probability"</span>: 1.0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"kwargs"</span>: {<span style="color: #008000;">"unique_pairs"</span>: <span style="color: #D0372D;">False</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"unique_parents"</span>: <span style="color: #D0372D;">False</span>}}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"fingerprinters"</span>: {<span style="color: #008000;">"keep_best"</span>: <span style="color: #D0372D;">True</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"diversify_module"</span>: {<span style="color: #008000;">"probability"</span>: 1.0,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"kwargs"</span>: {<span style="color: #008000;">"module"</span>: <span style="color: #008000;">"LAMMPS"</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>  <span style="color: #008000;">"min_diff"</span>: 0.001}}},
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #008000;">"post_processing"</span>: {<span style="color: #008000;">"XYZs"</span>: -1},
}

<span style="color: #BA36A5;">submit_parameters</span> = {<span style="color: #008000;">'system'</span>: <span style="color: #008000;">'PBS'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'queue'</span>: <span style="color: #008000;">'morgan2'</span>,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'nodes'</span>: 1,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'cores'</span>: 12,
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #9B9B9B; background-color: #EDEDED;"> </span><span style="color: #008000;">'walltime'</span>: 12}

<span style="color: #BA36A5;">optimizer</span> = <span style="color: #008000;">'genetic.py'</span>

<span style="color: #BA36A5;">job</span> = JobManager(calcdir, optimizer, StructOpt_parameters, submit_parameters)
<span style="color: #0000FF;">try</span>:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   job.optimize()
<span style="color: #0000FF;">except</span> (Submitted, Queued):
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">print</span>(calcdir, job.get_jobid(), <span style="color: #008000;">'submitted or queued'</span>)
<span style="color: #0000FF;">except</span> Running:
<span style="color: #9B9B9B; background-color: #EDEDED;"> </span>   <span style="color: #0000FF;">pass</span>
</pre>
</div>
</div>
</div>
